---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs
source: html/8a38d657-538f-6ca2-ef33-77031f0dffee.htm
---
# ExternalDataInstanceRemovingFromDocumentEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.